test/artillery.yml
config:
  target: "http://localhost:8080"
  plugins:
    expect: {}
  phases:
    - duration: 5
      arrivalRate: 4
scenarios:
  - flow:
      - get:
          url: "/index.html"
          expect:
            - statusCode: 200
            - contentType: text/html
            - headerEquals:
                - "content-length"
                - "338"
  - flow:
      - get:
          url: "/unauthorized.html"
          expect:
            - statusCode: 403
  - flow:
      - get:
          url: "/zerobytefile"
          expect:
            - statusCode: 200
            - contentType: binary/octet-stream
            - headerEquals:
                - "content-length"
                - "0"
  - flow:
      - get:
          url: "/filenotfound"
          expect:
            - statusCode: 404
            - contentType: application/xml